controllers/FlowersController.php

    public function actionFlowersSlice()
    {
        $query = FlowerSlice::find();
        $flowers = Flowers::find()->all();
        $flowersAr = [];
        foreach ($flowers as $flower) {
            $flowersAr[$flower->id] = $flower->name_ru;
        }

        $pagination = new Pagination([
            'defaultPageSize' => 15,
            'totalCount' => $query->count(),
        ]);

        $flowersSlice = $query->orderBy('id')
            ->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();
---
SELECT * FROM `flowers`
SELECT COUNT(*) FROM `flower_slice`
SELECT * FROM `flower_slice` ORDER BY `id` LIMIT 15

    public function actionAddSlice()
    {

        $model = new FlowerSlice();
        $flowers = Flowers::find()->all();
        $flowersAr = [];
        foreach ($flowers as $flower) {
            $flowersAr[$flower->id] = $flower->name_ru;
        }

        if ($model->load(\Yii::$app->request->post())) {

           $model->user_id = \Yii::$app->user->id;
           $model->date_added = date('Y-m-d H:i:s');

         if ($model->save())
---
SELECT * FROM `flowers`
INSERT INTO `flower_slice` (`flower_id`, `cnt_slice`, `user_id`, `date_added`) VALUES ('3', 10, 100, '2021-10-14 18:42:45')